# tap's
tap "getantibody/antibody"
tap "homebrew/completions"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "homebrew/versions"

# OSX BrewFile
brew 'ack'
brew 'go'
brew 'imagemagick'
brew 'unrar'
brew "antibody"
brew "autoconf"
brew "automake"
brew "bash"
brew "brew-cask-completion"
brew "bash-completion2"
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "wifi-password"
brew "bzip2"
brew "chruby"
brew "cmake"
brew "ddrescue"
brew "direnv"
brew "dnscrypt-proxy", restart_service: :changed
brew "dnsmap"
brew "dnstop"
brew "fish"
brew "gcc"
brew "getdns"
brew "gibo"
brew "git"
brew "git-extras"
brew "git-flow"
brew "git-open"
brew "gitversion"
brew "grc"
brew "grep"
brew "gzip"
brew "htop"
brew "hub"
brew "hunspell"
brew "iftop"
brew "ipcalc"
brew "less"
brew "make"
brew "mitmproxy"
brew "mongodb", restart_service: :changed
brew "mtr"
brew "nano"
brew "nmap"
brew "perl"
brew "python"
brew "python3"
brew "rsync"
brew "ruby-install"
brew "sqlite"
brew "tcpdump"
brew "tree"
brew "watch"
brew "watchman"
brew "wget"
brew "whois"
brew "wireshark"
brew "yarn", args: ["without-node"]
brew "nvm"
brew "zsh"
brew "awscli"
brew "zsh-completions"
brew "mas"
brew "curl"
brew "bundler-completion"
brew "docker-completion"
brew "launchctl-completion"
brew "rake-completion"
brew "ruby-completion"
brew "vagrant-completion"
brew "trash"
