# tap's
tap "getantibody/antibody"
tap "homebrew/completions"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "homebrew/versions"

# OSX BrewFile
brew 'ack'
brew 'gnu-sed'
brew 'awk'
brew 'ruby'
brew 'vim'
brew 'imagemagick'
brew 'unrar'
brew "autoconf"
brew "automake"
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "wifi-password"
brew "bzip2"
brew "cmake"
brew "ddrescue"
brew "direnv"
brew "dnsmap"
brew "dnstop"
brew "gcc"
brew "gibo"
brew "git"
brew "git-extras"
brew "git-flow"
brew "git-open"
brew "gitversion"
brew "grc"
brew "grep"
brew "gzip"
brew "htop"
brew "hub"
brew "hunspell"
brew "iftop"
brew "ipcalc"
brew "less"
brew "make"
brew "mitmproxy"
brew "mongodb", restart_service: :changed
brew "mtr"
brew "nano"
brew "perl"
brew "python"
brew "python3"
brew "rsync"
brew "ruby-install"
brew "sqlite"
brew "tcpdump"
brew "tree"
brew "watch"
brew "watchman"
brew "wget"
brew "whois"
brew "wireshark"
brew 'node'
brew "yarn"
brew "awscli"
brew "mas"
brew "curl"
brew "trash"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-lovers"
brew "zsh-navigation-tools"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
brew "liquidprompt"
brew "z"
brew "gnupg"
brew 'ncrack'
brew "lynx"
brew "youtube-dl"
brew "openssh"
brew "screen"
brew "ack"
brew "figlet"

# Install some CTF tools; see https://github.com/ctfs/write-ups.
brew "aircrack-ng"
# brew "bfg" # TODO: this needs to be installed after java which is a cask!
brew "binutils"
brew "binwalk"
brew "cifer"
brew "dex2jar"
brew "dns2tcp"
brew "fcrackzip"
brew "foremost"
brew "hashpump"
brew "hydra"
brew "john"
brew "knock"
brew "netpbm"
brew "nmap"
brew "pngcheck"
brew "socat"
brew "sqlmap"
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
# brew "ucspi-tcp # `tcpserver` etc." # TODO: Looks like this has been removed from brew. TBC
# brew "xpdf" # TODO: this needs to be installed after quartz
brew "xz"
brew "minisign"
# brew "dnscrypt-proxy", restart_service: :changed # TODO: this is still failing the install process even with minisign being installed for it.
brew "syncthing"
